DataProcessors/абс_ЗаполнитьСертификаты/абс_ЗаполнитьСертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ЗаполнитьСертификаты</name>
</mdclass:DataProcessor>

InformationRegisters/абс_ТоварыСертификатов/абс_ТоварыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ТоварыСертификатов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_ВидыСертификатовНаТовары/абс_ВидыСертификатовНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыСертификатовНаТовары</name>
  <enumValues>
    <name>ДекларацияСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СертификатСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СвидетельствоОГосрегистрации</name>
  </enumValues>
  <enumValues>
    <name>УдостоверениеКачества</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияТаможенногоСоюза</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_СертификатНаТовары/абс_СертификатНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СертификатНаТовары</name>
  <registerRecords>InformationRegister.абс_ТоварыСертификатов</registerRecords>
  <attributes>
    <name>ДатаНачалаДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияСертификата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Неактуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганСертификации</name>
    <type>
      <types>CatalogRef.абс_ОрганыСертификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>EnumRef.абс_ВидыСертификатовНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатазаписиВБазу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСертификата</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_УдостоверениеКачества</name>
    <type>
      <types>DocumentRef.абс_СертификатНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_УдостоверенияКачестваТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассаПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_КоличествоПартии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляВлаги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляМеталлич</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляМинеральныхПримесей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПосторонниеПримесиИВредители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассаТаблетки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_УсловияХранения</name>
    <type>
      <types>CatalogRef.КодыЗонХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_массаНетто</name>
    <comment>Нетто ед. фасовки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НТД</name>
    <type>
      <types>CatalogRef.Лео_НТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_номвходконтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АктНесоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_номерконверта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КодЗоныХранения</name>
    <type>
      <types>CatalogRef.Лео_КодЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаКапсулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаСодержимогоКапсулы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ЦветСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1020</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Диаметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_МассаТаблетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ФормаРазмеры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ГотовностьБлюд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ПолнаяРастворимость</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КонтрольОККПройден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОрганолептикаТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ФормаРазмерыТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_МассоваяДоляВлагиТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ВидСерии</name>
    <type>
      <types>CatalogRef.Лео_видыСерий</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДатаВыпуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_УдостоверенияКачества</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>DocumentRef.абс_СертификатНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Лео_СерииКомплектующих</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DataProcessors/абс_ЗаполнитьСертификаты/ManagerModule.bsl
Процедура ЗаполнитьСертификаты(Объект) Экспорт
	
	ТЧ_Товары = Объект.Товары;
	ТЧ_ВыгруженныеТовары = ТЧ_Товары.Выгрузить(, "Номенклатура,СерияНоменклатуры");
	
	
	//+Лео Сафонов ЕА
	//Подбор сертификатов на дату производства
	
	//ЗапросСертификаты = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ВТТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
	//|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	//|ИЗ
	//|	&ТоварыДокумента КАК ВТТоварыДокумента
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ТоварыДокумента.Номенклатура,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияСоответствия,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСвидетельствоОГосрегистрации,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСертификатСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСоответствия,
	//|	МАКСИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияТаможенногоСоюза,
	//|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ) КАК ОбязательноДекларацияСоответствия,
	//|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ) КАК ОбязательноДекларацияТаможенногоСоюза,
	//|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ) КАК ОбязательноСвидетельствоОГосрегистрации,
	//|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ) КАК ОбязательноСертификатСоответствия
	//|ИЗ
	//|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияСоответствия.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовДекларацияСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияСоответствия.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовДекларацияСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСвидетельствоОГосрегистрации
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСертификатСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСертификатСоответствия.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовСертификатСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСертификатСоответствия.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СертификатСоответствия))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияТаможенногоСоюза
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Номенклатура
	//|			И (&ДатаОтгрузки МЕЖДУ абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаОкончанияДействияСертификата)
	//|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияСоответствия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	//|			И (СвойстваДекларацияСоответствия.Свойство = &СвойствоДекларацияСоответствия)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияТаможенногоСоюза
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияТаможенногоСоюза.Объект
	//|			И (СвойстваДекларацияТаможенногоСоюза.Свойство = &СвойствоДекларацияТаможенногоСоюза)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСвидетельсвоОГосрегистрации
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСвидетельсвоОГосрегистрации.Объект
	//|			И (СвойстваСвидетельсвоОГосрегистрации.Свойство = &СвойствоСвидетельсвоОГосрегистрации)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСертификатСоответсвия
	//|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСертификатСоответсвия.Объект
	//|			И (СвойстваСертификатСоответсвия.Свойство = &СвойствоСертификатСоответсвия)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ТоварыДокумента.Номенклатура,
	//|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ),
	//|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ)");
	
	ЗапросСертификаты = Новый Запрос(	
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТТоварыДокумента.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВТТоварыДокумента.СерияНоменклатуры КАК Справочник.СерииНоменклатуры) КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	&ТоварыДокумента КАК ВТТоварыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияСоответствия,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСвидетельствоОГосрегистрации,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовСертификатСоответствия.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатСоответствия,
	|	МИНИМУМ(ЕСТЬNULL(абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор, ЗНАЧЕНИЕ(Документ.абс_СертификатНаТовары.ПустаяСсылка))) КАК абс_СертификатДекларацияТаможенногоСоюза,
	|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ) КАК ОбязательноДекларацияСоответствия,
	|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ) КАК ОбязательноДекларацияТаможенногоСоюза,
	|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ) КАК ОбязательноСвидетельствоОГосрегистрации,
	|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ) КАК ОбязательноСертификатСоответствия
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияСоответствия.Номенклатура
	|			И (абс_ТоварыСертификатовДекларацияСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияСоответствия))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовДекларацияСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияСоответствия.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСвидетельствоОГосрегистрации
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Номенклатура
	|			И (абс_ТоварыСертификатовСвидетельствоОГосрегистрации.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СвидетельствоОГосрегистрации))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСвидетельствоОГосрегистрации.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовСертификатСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовСертификатСоответствия.Номенклатура
	|			И (абс_ТоварыСертификатовСертификатСоответствия.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.СертификатСоответствия))
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовСертификатСоответствия.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовСертификатСоответствия.ДатаОкончанияДействияСертификата)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ТоварыСертификатов КАК абс_ТоварыСертификатовДекларацияТаможенногоСоюза
	|		ПО ВТ_ТоварыДокумента.Номенклатура = абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Номенклатура
	|			И (ВТ_ТоварыДокумента.СерияНоменклатуры.абс_ДатаПроизводства МЕЖДУ абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаНачалаДействияСертификата И абс_ТоварыСертификатовДекларацияТаможенногоСоюза.ДатаОкончанияДействияСертификата)
	|			И (абс_ТоварыСертификатовДекларацияТаможенногоСоюза.Регистратор.ВидСертификата = ЗНАЧЕНИЕ(Перечисление.абс_ВидыСертификатовНаТовары.ДекларацияТаможенногоСоюза))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияСоответствия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияСоответствия.Объект
	|			И (СвойстваДекларацияСоответствия.Свойство = &СвойствоДекларацияСоответствия)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваДекларацияТаможенногоСоюза
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваДекларацияТаможенногоСоюза.Объект
	|			И (СвойстваДекларацияТаможенногоСоюза.Свойство = &СвойствоДекларацияТаможенногоСоюза)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСвидетельсвоОГосрегистрации
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСвидетельсвоОГосрегистрации.Объект
	|			И (СвойстваСвидетельсвоОГосрегистрации.Свойство = &СвойствоСвидетельсвоОГосрегистрации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваСертификатСоответсвия
	|		ПО ВТ_ТоварыДокумента.Номенклатура = СвойстваСертификатСоответсвия.Объект
	|			И (СвойстваСертификатСоответсвия.Свойство = &СвойствоСертификатСоответсвия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ЕСТЬNULL(СвойстваДекларацияСоответствия.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваДекларацияТаможенногоСоюза.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваСвидетельсвоОГосрегистрации.Значение, ЛОЖЬ),
	|	ЕСТЬNULL(СвойстваСертификатСоответсвия.Значение, ЛОЖЬ)");
	
	ЗапросСертификаты.УстановитьПараметр("ТоварыДокумента", ТЧ_ВыгруженныеТовары);
	
	//Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаказПокупателя") Тогда
	//	ЗапросСертификаты.УстановитьПараметр("ДатаОтгрузки", Объект.ДатаОтгрузки);
	//ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
	//	ЗапросСертификаты.УстановитьПараметр("ДатаОтгрузки", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	//КонецЕсли;
	//-Лео Сафонов ЕА
	
	ЗапросСертификаты.УстановитьПараметр("СвойствоДекларацияСоответствия", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДекларацияСоответствия);
	ЗапросСертификаты.УстановитьПараметр("СвойствоДекларацияТаможенногоСоюза", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ДекларацияТаможенногоСоюза);
	ЗапросСертификаты.УстановитьПараметр("СвойствоСвидетельсвоОГосрегистрации", ПланыВидовХарактеристик.СвойстваОбъектов.абс_СвидетельствоОГосрегистрации);
	ЗапросСертификаты.УстановитьПараметр("СвойствоСертификатСоответсвия", ПланыВидовХарактеристик.СвойстваОбъектов.абс_СертификатСоответствия);
	
	
	Выборка = ЗапросСертификаты.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокиПоНоменклатуре = ТЧ_Товары.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
		
		Для Каждого СтрокаПоНоменклатуре Из СтрокиПоНоменклатуре Цикл
			ЗаполнитьЗначенияСвойств(СтрокаПоНоменклатуре, Выборка, "абс_СертификатДекларацияСоответствия, абс_СертификатСвидетельствоОГосрегистрации, абс_СертификатСоответствия, абс_СертификатДекларацияТаможенногоСоюза");
			Если Выборка.ОбязательноДекларацияСоответствия И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатДекларацияСоответствия) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнена декларация соответствия");
			КонецЕсли;
			Если Выборка.ОбязательноДекларацияТаможенногоСоюза И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатДекларацияТаможенногоСоюза) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнена декларация таможенного союза");
			КонецЕсли;
			Если Выборка.ОбязательноСвидетельствоОГосрегистрации И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатСвидетельствоОГосрегистрации) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнено свидетельство о госрегистрации");
			КонецЕсли;
			Если Выборка.ОбязательноСертификатСоответствия И Не ЗначениеЗаполнено(СтрокаПоНоменклатуре.абс_СертификатСоответствия) Тогда
				Сообщить("В строке " + СтрокаПоНоменклатуре.НомерСтроки + " для номенклатуры " + Выборка.Номенклатура + " не заполнен сертификат соответствия");
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
